src/cf/Catalogs/ЗаписиКалендаряСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЗаписиКалендаряСотрудника</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Завершено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИсточникЗаписейКалендаря</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Календарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КалендариСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолонкаКалендаря</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КолонкиКалендарейСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Начало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиИсточника</Name>
					<Comment>Для связи со строкой табличной части источника</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйИсточника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактированиеЗапрещено</Name>
					<Comment>Запрет интерактивного редактирования записи в планировщике</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьETag</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКлюч</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/КалендариСотрудников/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Обработчик подписки на событие АктуализироватьЗаписиКалендаряПоИсточнику"
// Вызывается ПриЗаписи объекта, являющегося источником данных для записей календаря.
//
Процедура АктуализироватьЗаписиКалендаряПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписиПоИсточнику = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаписиКалендаря.Ссылка КАК Запись
		|ИЗ
		|	Справочник.ЗаписиКалендаряСотрудника КАК ЗаписиКалендаря
		|ГДЕ
		|	ЗаписиКалендаря.Источник = &Источник
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаписиКалендаря.Начало,
		|	ЗаписиКалендаря.Окончание";
	
	Запрос.УстановитьПараметр("Источник", Источник.Ссылка);
	
	ЗаписиПоИсточнику = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Запись");
	
	Источник.ОбновитьЗаписьКалендаряПриЗаписиИсточника(ЗаписиПоИсточнику);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Цвет текста выполненной задачи. Если переданный параметр не является типом Цвет или является видом АвтоЦвет,
// возвращается Новый Цвет()
// 
// Параметры:
//  ЦветФона - Цвет - Цвет фона задачи в Календаре 
// 
// Возвращаемое значение:
//  Цвет - Цвет текста выполненной задачи
Функция ЦветТекстаВыполненнойЗадачи(ЦветФона) Экспорт
	
	Если ТипЗнч(ЦветФона) <> Тип("Цвет") Или ЦветФона.Вид = ВидЦвета.АвтоЦвет Тогда
		Возврат Новый Цвет();
	КонецЕсли;
	
	ЦветФонаЗеленый = ЦветФона.Зеленый;
	ЦветФонаКрасный = ЦветФона.Красный;
	ЦветФонаСиний   = ЦветФона.Синий;
	
	КоэффициентГраницыКрасного = 0.299;
	КоэффициентГраницыЗеленого = 0.587;
	КоэффициентГраницыСинего   = 0.114;
	
	ГраницаКоэффициентаЧерного = 0.5;
	МаксимальноеЗначениеЦвета  = 255;
	
	КоэффициентЧерного = 1 - 
		( КоэффициентГраницыКрасного * ЦветФонаКрасный
		+ КоэффициентГраницыЗеленого * ЦветФонаЗеленый 
		+ КоэффициентГраницыСинего   * ЦветФонаСиний) / МаксимальноеЗначениеЦвета;
		
	ОтображатьСветлымТекстом = КоэффициентЧерного > ГраницаКоэффициентаЧерного;

	ЦветТекста = ?(ОтображатьСветлымТекстом,
		ЦветаСтиля.ЦветТекстаВыполненнойЗадачиКалендаряСветлый, ЦветаСтиля.ЦветТекстаВыполненнойЗадачиКалендаряТемный);
	
	Возврат ЦветТекста
	
КонецФункции

#КонецОбласти
